---
kind: property
id: P:Autodesk.Revit.DB.LinkElementId.LinkedElementId
source: html/02246788-d4e8-0d71-95dc-95301e95f1a1.htm
---
# Autodesk.Revit.DB.LinkElementId.LinkedElementId Property

The id of the element in the link, or invalidElementId if no link.

## Syntax (C#)
```csharp
public ElementId LinkedElementId { get; }
```